tap "armand-sauzay/homebrew-tap"

brew "git"
brew "wget"
brew "htop"
brew "fish"
brew "nmap"
brew "thefuck"
brew "node"
brew "gh"
brew "tmux"
brew "tpm"
brew "armand-sauzay/homebrew-tap/note"

cask "docker-desktop"
cask "iterm2"
cask "visual-studio-code"
cask "brave-browser"
cask "sequel-ace"
cask "keka"
cask "slack"
cask "keyboardcleantool"
cask "android-studio"
cask "steam"
cask "claude-code"
cask "claude-devtools"
